ITstreet1/Arduino_D1/boards.txt
esp8285.menu.FlashSize.1M192=1M (192K SPIFFS)
esp8285.menu.FlashSize.1M192.build.flash_size=1M
esp8285.menu.FlashSize.1M192.build.flash_ld=eagle.flash.1m192.ld
esp8285.menu.FlashSize.1M192.build.spiffs_start=0xCB000
esp8285.menu.FlashSize.1M192.build.spiffs_end=0xFB000
esp8285.menu.FlashSize.1M192.build.spiffs_blocksize=4096
esp8285.menu.FlashSize.1M192.upload.maximum_size=827376

esp8285.menu.FlashSize.1M160=1M (160K SPIFFS)
esp8285.menu.FlashSize.1M160.build.flash_size=1M
esp8285.menu.FlashSize.1M160.build.flash_ld=eagle.flash.1m160.ld
esp8285.menu.FlashSize.1M160.build.spiffs_start=0xD3000
esp8285.menu.FlashSize.1M160.build.spiffs_end=0xFB000
esp8285.menu.FlashSize.1M160.build.spiffs_blocksize=4096
esp8285.menu.FlashSize.1M160.upload.maximum_size=860144

esp8285.menu.FlashSize.1M144=1M (144K SPIFFS)
esp8285.menu.FlashSize.1M144.build.flash_size=1M
esp8285.menu.FlashSize.1M144.build.flash_ld=eagle.flash.1m144.ld
esp8285.menu.FlashSize.1M144.build.spiffs_start=0xD7000
esp8285.menu.FlashSize.1M144.build.spiffs_end=0xFB000
esp8285.menu.FlashSize.1M144.build.spiffs_blocksize=4096
esp8285.menu.FlashSize.1M144.upload.maximum_size=876528

esp8285.menu.FlashSize.1M128=1M (128K SPIFFS)
esp8285.menu.FlashSize.1M128.build.flash_size=1M
esp8285.menu.FlashSize.1M128.build.flash_ld=eagle.flash.1m128.ld
esp8285.menu.FlashSize.1M128.build.spiffs_start=0xDB000
esp8285.menu.FlashSize.1M128.build.spiffs_end=0xFB000
esp8285.menu.FlashSize.1M128.build.spiffs_blocksize=4096
esp8285.menu.FlashSize.1M128.upload.maximum_size=892912

esp8285.menu.FlashSize.1M64=1M (64K SPIFFS)
esp8285.menu.FlashSize.1M64.build.flash_size=1M
esp8285.menu.FlashSize.1M64.build.flash_ld=eagle.flash.1m64.ld
esp8285.menu.FlashSize.1M64.build.spiffs_start=0xEB000
esp8285.menu.FlashSize.1M64.build.spiffs_end=0xFB000
esp8285.menu.FlashSize.1M64.build.spiffs_blocksize=4096
esp8285.menu.FlashSize.1M64.upload.maximum_size=958448

esp8285.menu.ResetMethod.ck=ck
esp8285.menu.ResetMethod.ck.upload.resetmethod=ck
esp8285.menu.ResetMethod.nodemcu=nodemcu
esp8285.menu.ResetMethod.nodemcu.upload.resetmethod=nodemcu

##############################################################

d1_mini.name=WEMOS D1 & mini

d1_mini.upload.tool=esptool
d1_mini.upload.speed=460800
d1_mini.upload.resetmethod=nodemcu
d1_mini.upload.maximum_size=1044464
d1_mini.upload.maximum_data_size=81920
d1_mini.upload.wait_for_upload_port=true
d1_mini.serial.disableDTR=true
d1_mini.serial.disableRTS=true

d1_mini.build.mcu=esp8266
d1_mini.build.f_cpu=80000000L
d1_mini.build.board=ESP8266_WEMOS_D1MINI
d1_mini.build.core=esp8266
d1_mini.build.variant=d1_mini
d1_mini.build.flash_mode=dio
d1_mini.build.flash_size=4M
d1_mini.build.flash_freq=40
d1_mini.build.debug_port=
d1_mini.build.debug_level=

d1_mini.menu.CpuFrequency.80=80 MHz
d1_mini.menu.CpuFrequency.80.build.f_cpu=80000000L
d1_mini.menu.CpuFrequency.160=160 MHz
d1_mini.menu.CpuFrequency.160.build.f_cpu=160000000L

d1_mini.menu.UploadSpeed.921600=921600
d1_mini.menu.UploadSpeed.921600.upload.speed=921600
d1_mini.menu.UploadSpeed.115200=115200
d1_mini.menu.UploadSpeed.115200.upload.speed=115200
d1_mini.menu.UploadSpeed.9600=9600
d1_mini.menu.UploadSpeed.9600.upload.speed=9600
d1_mini.menu.UploadSpeed.57600=57600
d1_mini.menu.UploadSpeed.57600.upload.speed=57600
d1_mini.menu.UploadSpeed.256000.windows=256000
d1_mini.menu.UploadSpeed.256000.upload.speed=256000
d1_mini.menu.UploadSpeed.230400.linux=230400
d1_mini.menu.UploadSpeed.230400.macosx=230400
d1_mini.menu.UploadSpeed.230400.macosx=230400
d1_mini.menu.UploadSpeed.230400.upload.speed=230400
d1_mini.menu.UploadSpeed.460800.linux=460800
d1_mini.menu.UploadSpeed.460800.macosx=460800
d1_mini.menu.UploadSpeed.460800.upload.speed=460800
d1_mini.menu.UploadSpeed.512000.windows=512000
d1_mini.menu.UploadSpeed.512000.upload.speed=512000


d1_mini.menu.FlashSize.4M3M=4M (3M SPIFFS)
d1_mini.menu.FlashSize.4M3M.build.flash_size=4M
d1_mini.menu.FlashSize.4M3M.build.flash_ld=eagle.flash.4m.ld
d1_mini.menu.FlashSize.4M3M.build.spiffs_start=0x100000
d1_mini.menu.FlashSize.4M3M.build.spiffs_end=0x3FB000
d1_mini.menu.FlashSize.4M3M.build.spiffs_blocksize=8192
d1_mini.menu.FlashSize.4M3M.build.spiffs_pagesize=256

d1_mini.menu.FlashSize.4M1M=4M (1M SPIFFS)
d1_mini.menu.FlashSize.4M1M.build.flash_size=4M
d1_mini.menu.FlashSize.4M1M.build.flash_ld=eagle.flash.4m1m.ld
d1_mini.menu.FlashSize.4M1M.build.spiffs_start=0x300000
d1_mini.menu.FlashSize.4M1M.build.spiffs_end=0x3FB000
d1_mini.menu.FlashSize.4M1M.build.spiffs_blocksize=8192
d1_mini.menu.FlashSize.4M1M.build.spiffs_pagesize=256

d1_mini.menu.Debug.Disabled=Disabled
d1_mini.menu.Debug.Disabled.build.debug_port=
d1_mini.menu.Debug.Serial=Serial
d1_mini.menu.Debug.Serial.build.debug_port=-DDEBUG_ESP_PORT=Serial
d1_mini.menu.Debug.Serial1=Serial1
d1_mini.menu.Debug.Serial1.build.debug_port=-DDEBUG_ESP_PORT=Serial1

d1_mini.menu.DebugLevel.None____=None
d1_mini.menu.DebugLevel.None____.build.debug_level=
d1_mini.menu.DebugLevel.Core____=Core
d1_mini.menu.DebugLevel.Core____.build.debug_level=-DDEBUG_ESP_CORE
d1_mini.menu.DebugLevel.SSL_____=Core + SSL
d1_mini.menu.DebugLevel.SSL_____.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL
d1_mini.menu.DebugLevel.SSL_MEM_=Core + SSL + TLS Mem
d1_mini.menu.DebugLevel.SSL_MEM_.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL -DDEBUG_TLS_MEM
d1_mini.menu.DebugLevel.WiFic___=Core + WiFi
d1_mini.menu.DebugLevel.WiFic___.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_WIFI
d1_mini.menu.DebugLevel.WiFi____=WiFi
d1_mini.menu.DebugLevel.WiFi____.build.debug_level=-DDEBUG_ESP_WIFI
d1_mini.menu.DebugLevel.HTTPClient=HTTPClient
d1_mini.menu.DebugLevel.HTTPClient.build.debug_level=-DDEBUG_ESP_HTTP_CLIENT
d1_mini.menu.DebugLevel.HTTPClient2=HTTPClient + SSL
d1_mini.menu.DebugLevel.HTTPClient2.build.debug_level=-DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_SSL
d1_mini.menu.DebugLevel.HTTPUpdate=HTTPUpdate
d1_mini.menu.DebugLevel.HTTPUpdate.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE
d1_mini.menu.DebugLevel.HTTPUpdate2=HTTPClient + HTTPUpdate
d1_mini.menu.DebugLevel.HTTPUpdate2.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_UPDATE
d1_mini.menu.DebugLevel.HTTPUpdate3=HTTPClient + HTTPUpdate + Updater
d1_mini.menu.DebugLevel.HTTPUpdate3.build.debug_level=-DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_UPDATER
d1_mini.menu.DebugLevel.HTTPServer=HTTPServer
d1_mini.menu.DebugLevel.HTTPServer.build.debug_level=-DDEBUG_ESP_HTTP_SERVER
d1_mini.menu.DebugLevel.UPDATER=Updater
d1_mini.menu.DebugLevel.UPDATER.build.debug_level=-DDEBUG_ESP_UPDATER
d1_mini.menu.DebugLevel.OTA_____=OTA
d1_mini.menu.DebugLevel.OTA_____.build.debug_level=-DDEBUG_ESP_OTA
d1_mini.menu.DebugLevel.OTA2____=OTA + Updater
d1_mini.menu.DebugLevel.OTA2____.build.debug_level=-DDEBUG_ESP_OTA -DDEBUG_ESP_UPDATER
d1_mini.menu.DebugLevel.all_____=All
d1_mini.menu.DebugLevel.all_____.build.debug_level=-DDEBUG_ESP_CORE -DDEBUG_ESP_SSL -DDEBUG_ESP_WIFI -DDEBUG_ESP_HTTP_CLIENT -DDEBUG_ESP_HTTP_UPDATE -DDEBUG_ESP_HTTP_SERVER -DDEBUG_ESP_UPDATER -DDEBUG_ESP_OTA -DDEBUG_TLS_MEM

